Личный_помощник/src/InformationRegisters/ЗначенияТарифов/ЗначенияТарифов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияТарифов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/InformationRegisters/ЗначенияТарифов/ManagerModule.bsl
Функция ПолучитьЗначенияТарифов(Знач Услуги = Неопределено, Знач Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияТарифовСрезПоследних.Значение,
		|	ЗначенияТарифовСрезПоследних.ВидУслуги
		|ИЗ
		|	РегистрСведений.ЗначенияТарифов.СрезПоследних(&Дата, ВидУслуги В (&Услуги)) КАК ЗначенияТарифовСрезПоследних";
		
	Если Не ЗначениеЗаполнено(Услуги) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидУслуги В (&Услуги)", "");		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуги", Услуги);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
